# GetUnderlayOrientation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewPlan..::..GetUnderlayOrientation Method
ViewPlan Class See Also
---
Returns the underlay orientation of this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public UnderlayOrientation GetUnderlayOrientation()
```

Visual Basic
---
```text
Public Function GetUnderlayOrientation As UnderlayOrientation
```

Visual C++
---
```text
public:
UnderlayOrientation GetUnderlayOrientation()
```

# ### Return Value
The underlay orientation for this view.
# See Also
ViewPlan Class
Autodesk.Revit.DB Namespace